In [3]:
!pip install ipython-sql

Requirement already satisfied: ipython-sql in /home/jupyterlab/conda/envs/python/lib/python3.6/site-packages (0.3.9)
Requirement already satisfied: six in /home/jupyterlab/conda/envs/python/lib/python3.6/site-packages (from ipython-sql) (1.15.0)
Requirement already satisfied: ipython-genutils>=0.1.0 in /home/jupyterlab/conda/envs/python/lib/python3.6/site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: prettytable in /home/jupyterlab/conda/envs/python/lib/python3.6/site-packages (from ipython-sql) (0.7.2)
Requirement already satisfied: ipython>=1.0 in /home/jupyterlab/conda/envs/python/lib/python3.6/site-packages (from ipython-sql) (7.16.1)
Requirement already satisfied: sqlparse in /home/jupyterlab/conda/envs/python/lib/python3.6/site-packages (from ipython-sql) (0.3.1)
Requirement already satisfied: sqlalchemy>=0.6.7 in /home/jupyterlab/conda/envs/python/lib/python3.6/site-packages (from ipython-sql) (1.3.18)
Requirement already satisfied: jedi>=0.10 in /home/jupyterlab/conda/envs/python/lib/python3.6/site-packages (from ipython>=1.0->ipython-sql) (0.17.2)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in /home/jupyterlab/conda/envs/python/lib/python3.6/site-packages (from ipython>=1.0->ipython-sql) (3.0.5)
Requirement already satisfied: traitlets>=4.2 in /home/jupyterlab/conda/envs/python/lib/python3.6/site-packages (from ipython>=1.0->ipython-sql) (4.3.3)
Requirement already satisfied: backcall in /home/jupyterlab/conda/envs/python/lib/python3.6/site-packages (from ipython>=1.0->ipython-sql) (0.2.0)
Requirement already satisfied: decorator in /home/jupyterlab/conda/envs/python/lib/python3.6/site-packages (from ipython>=1.0->ipython-sql) (4.4.2)
Requirement already satisfied: pickleshare in /home/jupyterlab/conda/envs/python/lib/python3.6/site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: setuptools>=18.5 in /home/jupyterlab/conda/envs/python/lib/python3.6/site-packages (from ipython>=1.0->ipython-sql) (49.2.0.post20200712)
Requirement already satisfied: pexpect; sys_platform != "win32" in /home/jupyterlab/conda/envs/python/lib/python3.6/site-packages (from ipython>=1.0->ipython-sql) (4.8.0)
Requirement already satisfied: pygments in /home/jupyterlab/conda/envs/python/lib/python3.6/site-packages (from ipython>=1.0->ipython-sql) (2.6.1)
Requirement already satisfied: parso<0.8.0,>=0.7.0 in /home/jupyterlab/conda/envs/python/lib/python3.6/site-packages (from jedi>=0.10->ipython>=1.0->ipython-sql) (0.7.1)
Requirement already satisfied: wcwidth in /home/jupyterlab/conda/envs/python/lib/python3.6/site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.2.5)
Requirement already satisfied: ptyprocess>=0.5 in /home/jupyterlab/conda/envs/python/lib/python3.6/site-packages (from pexpect; sys_platform != "win32"->ipython>=1.0->ipython-sql) (0.6.0)

In [4]:
%load_ext sql

In [15]:
!pip install ibm_db_sa

Requirement already satisfied: ibm_db_sa in /home/jupyterlab/conda/envs/python/lib/python3.6/site-packages (0.3.3)
Requirement already satisfied: sqlalchemy>=0.7.3 in /home/jupyterlab/conda/envs/python/lib/python3.6/site-packages (from ibm_db_sa) (1.3.18)

In [16]:
import ibm_db_sa

In [17]:
%sql ibm_db_sa://rcz59621:sh-3wxsdgcvtch1p@dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net:50000/BLUDB

'Connected: rcz59621@BLUDB'

<H2> The database schema named rcz59621 consists of multiple tables. For now, we will consider 4 tables </H2>:

1. Employees
2. Jobs
3. Job_history
4. Departments

<H3> Using the Employees table </H3>

In [37]:
data = %sql SELECT * FROM employees

 * ibm_db_sa://rcz59621:***@dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net:50000/BLUDB
Done.

In [38]:
data

[('E1001    ', 'John', 'Thomas', '123456   ', datetime.date(1976, 1, 9), 'M', '5631 Rice, OakPark,IL', '100      ', Decimal('100000.00'), '30001    ', '2        '),
 ('E1002    ', 'Alice', 'James', '123457   ', datetime.date(1972, 7, 31), 'F', '980 Berry ln, Elgin,IL', '200      ', Decimal('80000.00'), '30002    ', '5        '),
 ('E1003    ', 'Steve', 'Wells', '123458   ', datetime.date(1980, 8, 10), 'M', '291 Springs, Gary,IL', '300      ', Decimal('50000.00'), '30002    ', '5        '),
 ('E1004    ', 'Santosh', 'Kumar', '123459   ', datetime.date(1985, 7, 20), 'M', '511 Aurora Av, Aurora,IL', '400      ', Decimal('60000.00'), '30004    ', '5        '),
 ('E1005    ', 'Ahmed', 'Hussain', '123410   ', datetime.date(1981, 1, 4), 'M', '216 Oak Tree, Geneva,IL', '500      ', Decimal('70000.00'), '30001    ', '2        '),
 ('E1006    ', 'Nancy', 'Allen', '123411   ', datetime.date(1978, 2, 6), 'F', '111 Green Pl, Elgin,IL', '600      ', Decimal('90000.00'), '30001    ', '2        '),
 ('E1007    ', 'Mary', 'Thomas', '123412   ', datetime.date(1975, 5, 5), 'F', '100 Rose Pl, Gary,IL', '650      ', Decimal('65000.00'), '30003    ', '7        '),
 ('E1008    ', 'Bharath', 'Gupta', '123413   ', datetime.date(1985, 5, 6), 'M', '145 Berry Ln, Naperville,IL', '660      ', Decimal('65000.00'), '30003    ', '7        '),
 ('E1009    ', 'Andrea', 'Jones', '123414   ', datetime.date(1990, 7, 9), 'F', '120 Fall Creek, Gary,IL', '234      ', Decimal('70000.00'), '30003    ', '7        '),
 ('E1010    ', 'Ann', 'Jacob', '123415   ', datetime.date(1982, 3, 30), 'F', '111 Britany Springs,Elgin,IL', '220      ', Decimal('70000.00'), '30004    ', '5        ')]

Which employees have a salary greater than the average salary?

In [36]:
%%sql 

SELECT *
FROM employees 
WHERE salary > (SELECT AVG(salary) FROM employees)

 * ibm_db_sa://rcz59621:***@dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net:50000/BLUDB
Done.

[('E1001    ', 'John', 'Thomas', '123456   ', datetime.date(1976, 1, 9), 'M', '5631 Rice, OakPark,IL', '100      ', Decimal('100000.00'), '30001    ', '2        '),
 ('E1002    ', 'Alice', 'James', '123457   ', datetime.date(1972, 7, 31), 'F', '980 Berry ln, Elgin,IL', '200      ', Decimal('80000.00'), '30002    ', '5        '),
 ('E1006    ', 'Nancy', 'Allen', '123411   ', datetime.date(1978, 2, 6), 'F', '111 Green Pl, Elgin,IL', '600      ', Decimal('90000.00'), '30001    ', '2        ')]

What are the first names, date of birth, job id and salary for all employees who were born in the 1970s

In [40]:
%%sql 

SELECT f_name, b_date, job_id, salary
FROM employees
WHERE year(b_date) like ('%197%')

 * ibm_db_sa://rcz59621:***@dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net:50000/BLUDB
Done.

[('John', datetime.date(1976, 1, 9), '100      ', Decimal('100000.00')),
 ('Alice', datetime.date(1972, 7, 31), '200      ', Decimal('80000.00')),
 ('Nancy', datetime.date(1978, 2, 6), '600      ', Decimal('90000.00')),
 ('Mary', datetime.date(1975, 5, 5), '650      ', Decimal('65000.00'))]

Find the total number of male and female employees in the company?

In [41]:
%%sql

SELECT COUNT(*) AS "Number of employees", sex
FROM employees 
GROUP BY sex

 * ibm_db_sa://rcz59621:***@dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net:50000/BLUDB
Done.

[(Decimal('5'), 'F'), (Decimal('5'), 'M')]

How many workers are managed by a particular manager?

In [43]:
%%sql

SELECT COUNT(*) AS "Number of workers", manager_id
FROM employees
GROUP BY manager_id
ORDER BY "Number of workers" desc

 * ibm_db_sa://rcz59621:***@dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net:50000/BLUDB
Done.

[(Decimal('3'), '30001    '),
 (Decimal('3'), '30003    '),
 (Decimal('2'), '30002    '),
 (Decimal('2'), '30004    ')]

### Combining multiple tables to retrieve more intriguing results

In [49]:
employees = %sql SELECT * FROM employees
departments = %sql SELECT * FROM departments 
jobs = %sql SELECT * FROM jobs
job_history = %sql SELECT * FROM job_history

 * ibm_db_sa://rcz59621:***@dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net:50000/BLUDB
Done.
 * ibm_db_sa://rcz59621:***@dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net:50000/BLUDB
Done.
 * ibm_db_sa://rcz59621:***@dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net:50000/BLUDB
Done.
 * ibm_db_sa://rcz59621:***@dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net:50000/BLUDB
Done.

In [50]:
employees

[('E1001    ', 'John', 'Thomas', '123456   ', datetime.date(1976, 1, 9), 'M', '5631 Rice, OakPark,IL', '100      ', Decimal('100000.00'), '30001    ', '2        '),
 ('E1002    ', 'Alice', 'James', '123457   ', datetime.date(1972, 7, 31), 'F', '980 Berry ln, Elgin,IL', '200      ', Decimal('80000.00'), '30002    ', '5        '),
 ('E1003    ', 'Steve', 'Wells', '123458   ', datetime.date(1980, 8, 10), 'M', '291 Springs, Gary,IL', '300      ', Decimal('50000.00'), '30002    ', '5        '),
 ('E1004    ', 'Santosh', 'Kumar', '123459   ', datetime.date(1985, 7, 20), 'M', '511 Aurora Av, Aurora,IL', '400      ', Decimal('60000.00'), '30004    ', '5        '),
 ('E1005    ', 'Ahmed', 'Hussain', '123410   ', datetime.date(1981, 1, 4), 'M', '216 Oak Tree, Geneva,IL', '500      ', Decimal('70000.00'), '30001    ', '2        '),
 ('E1006    ', 'Nancy', 'Allen', '123411   ', datetime.date(1978, 2, 6), 'F', '111 Green Pl, Elgin,IL', '600      ', Decimal('90000.00'), '30001    ', '2        '),
 ('E1007    ', 'Mary', 'Thomas', '123412   ', datetime.date(1975, 5, 5), 'F', '100 Rose Pl, Gary,IL', '650      ', Decimal('65000.00'), '30003    ', '7        '),
 ('E1008    ', 'Bharath', 'Gupta', '123413   ', datetime.date(1985, 5, 6), 'M', '145 Berry Ln, Naperville,IL', '660      ', Decimal('65000.00'), '30003    ', '7        '),
 ('E1009    ', 'Andrea', 'Jones', '123414   ', datetime.date(1990, 7, 9), 'F', '120 Fall Creek, Gary,IL', '234      ', Decimal('70000.00'), '30003    ', '7        '),
 ('E1010    ', 'Ann', 'Jacob', '123415   ', datetime.date(1982, 3, 30), 'F', '111 Britany Springs,Elgin,IL', '220      ', Decimal('70000.00'), '30004    ', '5        ')]

In [46]:
departments

[('2        ', 'Architect Group', '30001    ', 'L0001    '),
 ('5        ', 'Software Group', '30002    ', 'L0002    '),
 ('7        ', 'Design Team', '30003    ', 'L0003    ')]

In [47]:
jobs

[('100      ', 'Sr. Architect', Decimal('60000.00'), Decimal('100000.00')),
 ('200      ', 'Sr. Software De', Decimal('60000.00'), Decimal('80000.00')),
 ('220      ', 'Sr. Designer', Decimal('70000.00'), Decimal('90000.00')),
 ('234      ', 'Sr. Designer', Decimal('70000.00'), Decimal('90000.00')),
 ('300      ', 'Jr.Software Dev', Decimal('40000.00'), Decimal('60000.00')),
 ('400      ', 'Jr.Software Dev', Decimal('40000.00'), Decimal('60000.00')),
 ('500      ', 'Jr. Architect', Decimal('50000.00'), Decimal('70000.00')),
 ('600      ', 'Lead Architect', Decimal('70000.00'), Decimal('100000.00')),
 ('650      ', 'Jr. Designer', Decimal('60000.00'), Decimal('70000.00')),
 ('660      ', 'Jr. Designer', Decimal('60000.00'), Decimal('70000.00'))]

In [48]:
job_history

[('E1001    ', datetime.date(2000, 8, 1), '100      ', '2        '),
 ('E1002    ', datetime.date(2001, 8, 1), '200      ', '5        '),
 ('E1003    ', datetime.date(2001, 8, 16), '300      ', '5        '),
 ('E1004    ', datetime.date(2000, 8, 16), '400      ', '5        '),
 ('E1005    ', datetime.date(2000, 5, 30), '500      ', '2        '),
 ('E1006    ', datetime.date(2001, 8, 16), '600      ', '2        '),
 ('E1007    ', datetime.date(2002, 5, 30), '650      ', '7        '),
 ('E1008    ', datetime.date(2010, 5, 6), '660      ', '7        '),
 ('E1009    ', datetime.date(2016, 8, 16), '234      ', '7        '),
 ('E1010    ', datetime.date(2016, 8, 16), '220      ', '5        ')]

What are first names, salary and departments names for all employees?

In [51]:
%%sql

SELECT E.f_name, E.salary, D.dep_name
FROM employees E
JOIN departments D
ON E.dep_id = D.dept_id_dep
ORDER BY E.salary desc

 * ibm_db_sa://rcz59621:***@dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net:50000/BLUDB
Done.

[('John', Decimal('100000.00'), 'Architect Group'),
 ('Nancy', Decimal('90000.00'), 'Architect Group'),
 ('Alice', Decimal('80000.00'), 'Software Group'),
 ('Ahmed', Decimal('70000.00'), 'Architect Group'),
 ('Andrea', Decimal('70000.00'), 'Design Team'),
 ('Ann', Decimal('70000.00'), 'Software Group'),
 ('Mary', Decimal('65000.00'), 'Design Team'),
 ('Bharath', Decimal('65000.00'), 'Design Team'),
 ('Santosh', Decimal('60000.00'), 'Software Group'),
 ('Steve', Decimal('50000.00'), 'Software Group')]

What are last names, salary, job title and manager ids for the top 5 highest paid employees?

In [56]:
%%sql

SELECT E.f_name, E.salary, J.job_title, E.manager_id
FROM employees E
JOIN jobs J
ON E.job_id = J.job_ident
ORDER BY E.salary desc
LIMIT 5

 * ibm_db_sa://rcz59621:***@dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net:50000/BLUDB
Done.

[('John', Decimal('100000.00'), 'Sr. Architect', '30001    '),
 ('Nancy', Decimal('90000.00'), 'Lead Architect', '30001    '),
 ('Alice', Decimal('80000.00'), 'Sr. Software De', '30002    '),
 ('Ahmed', Decimal('70000.00'), 'Jr. Architect', '30001    '),
 ('Andrea', Decimal('70000.00'), 'Sr. Designer', '30003    ')]

How many employees joined the company between 2000 and 2005?

In [66]:
%%sql

SELECT COUNT(E.emp_id) AS " Number of employees", year(JH.start_date) AS "Start year"
FROM 
employees E
JOIN job_history JH
ON E.emp_id = JH.empl_id
WHERE year(JH.start_date) BETWEEN 2000 AND 2005
GROUP BY year(JH.start_date)

 * ibm_db_sa://rcz59621:***@dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net:50000/BLUDB
Done.

[(Decimal('3'), 2000), (Decimal('3'), 2001), (Decimal('1'), 2002)]